
def area(a):
    '''
    Находит площадь квадрата со стороной a.

        Параметры:
                a(int): десятичное вещественное число

        Возвращаемое значение:
                area(int): десятичное вещественное число

        Пример:
                area(3) = 3 * 3 = 9

    '''
    return a * a


def perimeter(a):
    '''
    Находит периметр квадрата со стороной a.

        Параметры:
                a(int): десятичное вещественное число

        Возвращаемое значение:
                area(int): десятичное вещественное число

        Пример:
                area(3) = 4 * 3 = 12

    '''
    return 4 * a
